"""

*******
*     *
*     *
*     *
*     *
*******

"""

# a = 7
# b = 1
# for i in range(0,10):
#     if i >= 5:
#         print(str(b) * b)
#         b = b + 1
#     else:
#         a = a - 1
#         print(str(a) * a) 


for i in range(6):
    for j in range(i + 1):
        print(j,end="")
    print()

# 1~100까지의 수 중에서 홀수와 홀수의 합을 실행 결과와 같이 출력하는 프로그램을 작성하시오. (1+3+5+...+99)

# 👉 실행 결과
# 1 + 3 + 5 + 7 + 9 + 11 + 13 + 15 + 17 + 19
# + 21 + 23 + 25 + 27 + 29 + 31 + 33 + 35 + 37 + 39
# + 41 + 43 + 45 + 47 + 49 + 51 + 53 + 55 + 57 + 59
# + 61 + 63 + 65 + 67 + 69 + 71 + 73 + 75 + 77 + 79
# + 81 + 83 + 85 + 87 + 89 + 91 + 93 + 95 + 97 + 99 = 2500